DIGITS = {
        "zero": {0: "ноль"},
        "units": {
            1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
            7: "семь", 8: "восемь", 9: "девять", 0: ""
        },
        "tens": {
            2: "двадцать", 3: "тридцать", 4: "сорок", 5: "пятьдесят",
            6: "шестьдесят", 7: "семьдесят", 8: "восемьдесят", 9: "девяносто"
        },
        "hundreds": {
            1: "сто", 2: "двести", 3: "триста", 4: "четыреста", 5: "пятьсот",
            6: "шестьсот", 7: "семьсот", 8: "восемьсот", 9: "девятьсот"
        },
        "teen": {
            10: "десять", 11: "одинадцать", 12: "двенадцать", 13: "тринадцать",
            14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать",
            18: "восемнадцать", 19: "девятнадцать"
        },
        "thousands_ends": {
            1: "ча", 2: "чи", 3: "чи", 4: "чи", 5: "ч", 6: "ч", 7: "ч", 8: "ч",
            9: "ч", 0: "ч"
        }
    }
